tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
# Automatically formats Python code to conform to the PEP 8 style guide
brew "autopep8"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Command-line fuzzy finder written in Go
brew "fzf"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Java-based project management
brew "maven"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node@16"
# Development kit for the Java programming language
brew "openjdk@17"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Code-search similar to ack
brew "the_silver_searcher"
# Simplified and community-driven man pages
brew "tldr"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# GPU-accelerated terminal emulator
cask "alacritty"
# Icon set and toolkit
cask "font-fontawesome"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Smooths scrolling and set mouse scroll directions independently
cask "mos"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
